In [1]:
# Data preprocessing using pandas and numpy
# Data Visualization using matplotlib

In [2]:
# Introducing python

In [3]:
print("hello world")

hello world

In [4]:
a = 3
b = 4
c = a+b

In [5]:
print(c)

7

In [6]:
# Lets  get start with pandas
# start with series

In [7]:
import pandas as pd

In [9]:
# series objects
s1 = pd.Series(10)
s1

0    10
dtype: int64

In [10]:
# It gives index and value
# index   value

In [11]:
s2 = pd.Series([10,20,30,40,50])
s2

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [12]:
# above generate series

In [15]:
name = pd.Series(["amber", "gautam", "John"], index = ['a', 'g', 'j'])

In [16]:
name
# by this we will get index values which we specified

a     amber
g    gautam
j      John
dtype: object

In [19]:
# now with dictionaries
name2 = pd.Series({'a':'amber','g':'gautam', 'j':'john', 'b':'bob'})
name2

a     amber
g    gautam
j      john
b       bob
dtype: object

In [20]:
# now start with numpy 
import numpy as np

In [22]:
views = pd.Series([100,200,150,300,600,150, np.nan])
views
# Nan: no values, given by numpy

0    100.0
1    200.0
2    150.0
3    300.0
4    600.0
5    150.0
6      NaN
dtype: float64

In [23]:
# length of views series
len(views)

7

In [24]:
# another way to get of length
views.shape

(7,)

In [25]:
# another method to get length
views.size

7

In [28]:
# get non NAN value
views.count()

6

In [29]:
# get the unique values
views.unique()

array([100., 200., 150., 300., 600.,  nan])

In [30]:
# frequency of values
views.value_counts()

150.0    2
600.0    1
300.0    1
200.0    1
100.0    1
dtype: int64

In [31]:
# lets start with new series
new_series = pd.Series([100,200,100,400,300,500,np.nan], index = ['sun', 'mon','tue','wed','thu','fri','sat'])

In [32]:
new_series

sun    100.0
mon    200.0
tue    100.0
wed    400.0
thu    300.0
fri    500.0
sat      NaN
dtype: float64

In [33]:
# get index
new_series.index

Index(['sun', 'mon', 'tue', 'wed', 'thu', 'fri', 'sat'], dtype='object')

In [34]:
# get the values
new_series.values

array([100., 200., 100., 400., 300., 500.,  nan])

In [37]:
# slice a specific rows
# empty head give first five rows
new_series.head()

sun    100.0
mon    200.0
tue    100.0
wed    400.0
thu    300.0
dtype: float64

In [36]:
new_series.head(2)

sun    100.0
mon    200.0
dtype: float64

In [38]:
# get last rows
new_series.tail(3)

thu    300.0
fri    500.0
sat      NaN
dtype: float64

In [39]:
new_series.tail()

tue    100.0
wed    400.0
thu    300.0
fri    500.0
sat      NaN
dtype: float64

In [41]:
# Retrieve a value from new_series
new_series['sun']

100.0

In [42]:
# using index
new_series[1]

200.0

In [43]:
new_series[['mon','sat']]

mon    200.0
sat      NaN
dtype: float64

In [44]:
new_series[[2,1]]

tue    100.0
mon    200.0
dtype: float64

In [45]:
new_series.take([0,1,3])

sun    100.0
mon    200.0
wed    400.0
dtype: float64

In [46]:
# above are to get data using index or positions

In [47]:
# now srting series

In [48]:
string = pd.Series(['100', '200', '300'], index = ['a','b','c'])
string

a    100
b    200
c    300
dtype: object

In [52]:
string[1]

'200'

In [53]:
# get by label
string['a']

'100'

In [55]:
integer = pd.Series([1,2,33,4])
integer

0     1
1     2
2    33
3     4
dtype: int64

In [56]:
 integer.loc[1]

2

In [61]:
# not start with index 0 get by label
integer.iloc[3]

4

In [62]:
integer.iloc[[1,2]]

1     2
2    33
dtype: int64

In [63]:
integer.iloc[[2,3,1]]

2    33
3     4
1     2
dtype: int64

In [64]:
integer.loc[[1]]

1    2
dtype: int64

In [67]:
integer.loc[[1,2,3,4,5]]

/home/amber/Desktop/DataScience/env/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

1     2.0
2    33.0
3     4.0
4     NaN
5     NaN
dtype: float64

In [68]:
# If data is not present it will give NaN

In [ ]:
# Alignment in pandas

In [72]:
series1 = pd.Series([50,60,70,80], index = ['e','f','g','h'])
series1

e    50
f    60
g    70
h    80
dtype: int64

In [73]:
series2 = pd.Series([20,30,40,50], index = ['h','g','f','e'])
series2

h    20
g    30
f    40
e    50
dtype: int64

In [74]:
# Now add 
series1 + series2

e    100
f    100
g    100
h    100
dtype: int64

In [75]:
# same index values are add
# pandas firstly align the data than apply the arithematic operations
series3 = pd.Series([10,20,40,50,60], index = ['a','p','c','d','f'])
series3

a    10
p    20
c    40
d    50
f    60
dtype: int64

In [76]:
series4 = pd.Series([80,20,44,22,11], index = ['a','p','c','d','f'])
series4

a    80
p    20
c    44
d    22
f    11
dtype: int64

In [77]:
# use in many statistical data, to deal with messing data
series3 + series4

a    90
p    40
c    84
d    72
f    71
dtype: int64

In [78]:
# Now search with duplicated data
series5 = pd.Series([10,20,30], index = ['x','x','y'])
series5

x    10
x    20
y    30
dtype: int64

In [79]:
series6 = pd.Series([40,50,60], index = ['x','x','z'])
series6

x    40
x    50
z    60
dtype: int64

In [80]:
series5 + series6

x    50.0
x    60.0
x    60.0
x    70.0
y     NaN
z     NaN
dtype: float64

In [82]:
# How we get the above result, one x is add with both
#  duplicate labels will match in alignment and non duplicate not

In [83]:
# lets try multiplication
series5 * series6

x     400.0
x     500.0
x     800.0
x    1000.0
y       NaN
z       NaN
dtype: float64

In [84]:
series5 * 10

x    100
x    200
y    300
dtype: int64

In [85]:
series6 * 100

x    4000
x    5000
z    6000
dtype: int64

In [86]:
# different ways to changing series data
new = pd.Series([10,20,30,50])
new

0    10
1    20
2    30
3    50
dtype: int64

In [87]:
# in above index are automatic generated
# we also give index

In [88]:
new.index = ['a','b','c','d']
new

a    10
b    20
c    30
d    50
dtype: int64

In [90]:
# remember always index no is same as data no
new_1 = new.reindex(['a','b','c','d','e','f'])

In [92]:
# by reindex we will get NAN value for extra index
new_1

a    10.0
b    20.0
c    30.0
d    50.0
e     NaN
f     NaN
dtype: float64

In [93]:
# In many cases we need reindexing, how? lets check

In [94]:
series7 = pd.Series([10,20,50], index = ['1','2','3'])
series7

1    10
2    20
3    50
dtype: int64

In [95]:
series7 + new

1   NaN
2   NaN
3   NaN
a   NaN
b   NaN
c   NaN
d   NaN
dtype: float64

In [100]:
# Modify series and slicing

In [101]:
grades = pd.Series([49,200,30,45], index = ['amber', 'gautam', 'john', 'jack'])
grades

amber      49
gautam    200
john       30
jack       45
dtype: int64

In [102]:
# now change the grade of john or (solve illogical or wring value)
# so correct this
grades['gautam'] = 33
grades

amber     49
gautam    33
john      30
jack      45
dtype: int64

In [103]:
# delete row
# amber row data is delete
del(grades['amber'])

In [104]:
grades

gautam    33
john      30
jack      45
dtype: int64

In [105]:
# add more items in above series
grades = pd.Series([49,200,30,45,22,43], index = ['amber', 'gautam', 'john', 'jack', 'mark', 'ayan'])
grades

amber      49
gautam    200
john       30
jack       45
mark       22
ayan       43
dtype: int64

In [106]:
# slice the data
grades[0:4]

amber      49
gautam    200
john       30
jack       45
dtype: int64

In [107]:
# last parameter is for difference
grades[0:4:2]

amber    49
john     30
dtype: int64

In [108]:
grades[:4]

amber      49
gautam    200
john       30
jack       45
dtype: int64

In [109]:
grades[4:]

mark    22
ayan    43
dtype: int64

In [110]:
grades[:-1]

amber      49
gautam    200
john       30
jack       45
mark       22
dtype: int64

In [111]:
grades[:]

amber      49
gautam    200
john       30
jack       45
mark       22
ayan       43
dtype: int64

In [112]:
grades[:3:4]

amber    49
dtype: int64

In [113]:
grades[4::-2]

mark     22
john     30
amber    49
dtype: int64

In [114]:
grades[-3]

45

In [115]:
grades[:-3]

amber      49
gautam    200
john       30
dtype: int64

In [116]:
# Now deal with rows and tables 
# Dataframes
# create a dataframe

In [117]:
# create series object
sales = pd.Series([200,300,400,500], index = ['microsoft', 'google','yahoo', 'facebook'])
sales

microsoft    200
google       300
yahoo        400
facebook     500
dtype: int64

In [118]:
# create the dataframe of above series
df1 = pd.DataFrame({2018:sales})
df1

           2018
microsoft   200
google      300
yahoo       400
facebook    500

In [119]:
# so above is the dataframe of one series
sales2 = pd.Series([2000,3000,4000,5000], index = ['microsoft', 'google','yahoo', 'facebook'])
sales2

microsoft    2000
google       3000
yahoo        4000
facebook     5000
dtype: int64

In [120]:
sales3 = pd.Series([20,30,40,50], index = ['microsoft', 'google','yahoo', 'facebook'])
sales3

microsoft    20
google       30
yahoo        40
facebook     50
dtype: int64

In [121]:
df2 = pd.DataFrame({2019:sales2, 2017:sales, 2018:sales3})
df2

           2019  2017  2018
microsoft  2000   200    20
google     3000   300    30
yahoo      4000   400    40
facebook   5000   500    50

In [122]:
df2.shape

(4, 3)

In [124]:
# change lables
df2.columns = ['A','B','C']
df2

              A    B   C
microsoft  2000  200  20
google     3000  300  30
yahoo      4000  400  40
facebook   5000  500  50

In [125]:
# change index 
df2.index = ['M', 'G','Y','F']
df2

      A    B   C
M  2000  200  20
G  3000  300  30
Y  4000  400  40
F  5000  500  50

In [126]:
# columns names can be access using columns property

In [127]:
df2.columns

Index(['A', 'B', 'C'], dtype='object')

In [128]:
df2.index

Index(['M', 'G', 'Y', 'F'], dtype='object')

In [129]:
# Data frame properties 
# recall series
sales2 = pd.Series([2000,3000,4000,5000], index = ['microsoft', 'google','yahoo', 'facebook'])
sales2

microsoft    2000
google       3000
yahoo        4000
facebook     5000
dtype: int64

In [130]:
sales1 = pd.Series([200,300,400,500], index = ['microsoft', 'google','yahoo', 'facebook'])
sales

microsoft    200
google       300
yahoo        400
facebook     500
dtype: int64

In [131]:
sales3 = pd.Series([20,30,40,50], index = ['microsoft', 'google','yahoo', 'facebook'])

In [132]:
sales3

microsoft    20
google       30
yahoo        40
facebook     50
dtype: int64

In [133]:
df1 = pd.DataFrame({2017:sales1, 2018:sales2, 2019:sales3 })
df1

           2017  2018  2019
microsoft   200  2000    20
google      300  3000    30
yahoo       400  4000    40
facebook    500  5000    50

In [134]:
df1[{2018}]

           2018
microsoft  2000
google     3000
yahoo      4000
facebook   5000

In [135]:
df1[{2018, 2019}]

           2018  2019
microsoft  2000    20
google     3000    30
yahoo      4000    40
facebook   5000    50

In [137]:
# access columns and row
# first two rows
df1[[2018,2019]].head(2)

           2018  2019
microsoft  2000    20
google     3000    30

In [139]:
#  last 2 rows
df1[[2018,2019]].tail(2)

          2018  2019
yahoo     4000    40
facebook  5000    50

In [140]:
df1[[2018,2019]].take([0,2])

           2018  2019
microsoft  2000    20
yahoo      4000    40

In [141]:
type(df1[[2018,2019]].take([0,2]))

pandas.core.frame.DataFrame

In [145]:
type(df1[2018].head(2))

pandas.core.series.Series

In [146]:
# create data frames with multiple series objects
df1[1:2]

        2017  2018  2019
google   300  3000    30

In [151]:
df2[1:3]

      A    B   C
G  3000  300  30
Y  4000  400  40

In [152]:
df1[:2]

           2017  2018  2019
microsoft   200  2000    20
google      300  3000    30

In [153]:
df3= pd.DataFrame({'A':sales1, 'B': sales2, 'C':sales3})
df3

             A     B   C
microsoft  200  2000  20
google     300  3000  30
yahoo      400  4000  40
facebook   500  5000  50

In [155]:
# row greater than 200
df2.A > 300
df2.B > 300

M    False
G    False
Y     True
F     True
Name: B, dtype: bool

In [156]:
df2.C>300

M    False
G    False
Y    False
F    False
Name: C, dtype: bool

In [160]:
# access google sale in 2018
df1.at['google', 2018]

3000

In [161]:
# row 1 and colums 2
df1.iat[0,2]

20

In [162]:
df1

           2017  2018  2019
microsoft   200  2000    20
google      300  3000    30
yahoo       400  4000    40
facebook    500  5000    50

In [164]:
# suppose data frame has wrong column name, "rename" will use
# lets change 2018 to 2014, but data is not change
new_df = df1.rename(columns = {2018:2014})
new_df

           2017  2014  2019
microsoft   200  2000    20
google      300  3000    30
yahoo       400  4000    40
facebook    500  5000    50

In [165]:
df1

           2017  2018  2019
microsoft   200  2000    20
google      300  3000    30
yahoo       400  4000    40
facebook    500  5000    50

In [168]:
# modification not in original
df1.rename(columns = {2018:2014})

           2017  2014  2019
microsoft   200  2000    20
google      300  3000    30
yahoo       400  4000    40
facebook    500  5000    50

In [170]:
# change in original
df1.rename(columns = {2018:2014}, inplace = True)

In [171]:
df1

           2017  2014  2019
microsoft   200  2000    20
google      300  3000    30
yahoo       400  4000    40
facebook    500  5000    50

In [172]:
# change new colums
df1[2020] = ([20,30,50,60])

In [174]:
# by this new column will add
df1

           2017  2014  2019  2020
microsoft   200  2000    20    20
google      300  3000    30    30
yahoo       400  4000    40    50
facebook    500  5000    50    60

In [175]:
df1

           2017  2014  2019  2020
microsoft   200  2000    20    20
google      300  3000    30    30
yahoo       400  4000    40    50
facebook    500  5000    50    60

In [176]:
# add new column at specific position
df1.insert(3,2008,[20,30,50,55])
df1

           2017  2014  2019  2008  2020
microsoft   200  2000    20    20    20
google      300  3000    30    30    30
yahoo       400  4000    40    50    50
facebook    500  5000    50    55    60

In [177]:
# change the column name
df1.columns = ['a','b','c','d','e']

In [179]:
df1

             a     b   c   d   e
microsoft  200  2000  20  20  20
google     300  3000  30  30  30
yahoo      400  4000  40  50  50
facebook   500  5000  50  55  60

In [180]:
# check relations
df1.a = df1.b/2

In [181]:
df1

                a     b   c   d   e
microsoft  1000.0  2000  20  20  20
google     1500.0  3000  30  30  30
yahoo      2000.0  4000  40  50  50
facebook   2500.0  5000  50  55  60

In [182]:
# delete column
del df1['a']

In [183]:
df1

              b   c   d   e
microsoft  2000  20  20  20
google     3000  30  30  30
yahoo      4000  40  50  50
facebook   5000  50  55  60

In [184]:
pop_method = df1.pop('b')

In [185]:
df1

            c   d   e
microsoft  20  20  20
google     30  30  30
yahoo      40  50  50
facebook   50  55  60

In [186]:
pop_method

microsoft    2000
google       3000
yahoo        4000
facebook     5000
Name: b, dtype: int64

In [187]:
# pop will save deleted method

In [189]:
# show all column data except 'd'
drop_method = df1.drop(['d'], axis =1)

In [191]:
df1

            c   d   e
microsoft  20  20  20
google     30  30  30
yahoo      40  50  50
facebook   50  55  60

In [192]:
drop_method

            c   e
microsoft  20  20
google     30  30
yahoo      40  50
facebook   50  60

In [193]:
# Now lets play with another data
sales_1 = pd.Series([200,300,400,500], index = ['amazon', 'ebay', 'jumia', 'etsy'])
sales_1

amazon    200
ebay      300
jumia     400
etsy      500
dtype: int64

In [194]:
sales_2 = pd.Series([2000,3050,4500,5600], index = ['amazon', 'ebay', 'jumia', 'etsy'])
sales_3 = pd.Series([220,350,450,560], index = ['amazon', 'ebay', 'jumia', 'etsy'])

In [195]:
df_new = pd.DataFrame({2017:sales_1, 2018:sales_2, 2019:sales_3})
df_new

        2017  2018  2019
amazon   200  2000   220
ebay     300  3050   350
jumia    400  4500   450
etsy     500  5600   560

In [197]:
df1

            c   d   e
microsoft  20  20  20
google     30  30  30
yahoo      40  50  50
facebook   50  55  60

In [198]:
df1 * 2

             c    d    e
microsoft   40   40   40
google      60   60   60
yahoo       80  100  100
facebook   100  110  120

In [200]:
a = df2 * 2

In [201]:
a

       A     B    C
M   4000   400   40
G   6000   600   60
Y   8000   800   80
F  10000  1000  100

In [202]:
a * 2

       A     B    C
M   8000   800   80
G  12000  1200  120
Y  16000  1600  160
F  20000  2000  200

In [205]:
df = 200 -df2

In [206]:
df

      A    B    C
M -1800    0  180
G -2800 -100  170
Y -3800 -200  160
F -4800 -300  150

In [207]:
v1 = df2[0:2]

In [208]:
v1

      A    B   C
M  2000  200  20
G  3000  300  30

In [209]:
v1 + df1

            A   B   C   c   d   e
G         NaN NaN NaN NaN NaN NaN
M         NaN NaN NaN NaN NaN NaN
facebook  NaN NaN NaN NaN NaN NaN
google    NaN NaN NaN NaN NaN NaN
microsoft NaN NaN NaN NaN NaN NaN
yahoo     NaN NaN NaN NaN NaN NaN

In [210]:
v1 + df2

        A      B     C
F     NaN    NaN   NaN
G  6000.0  600.0  60.0
M  4000.0  400.0  40.0
Y     NaN    NaN   NaN